<?php

/*
 * translit($str)
 * транслитерация символов
 * все символы, которые не входят в масссив $translit, будут заменены на _ (нижнее подчёркивание) 
 * */

$str = 'в «академии футбола Краснодара»  2002)';
function translit($str) 
{
$translit = array(
	        "А"=>"A","Б"=>"B","В"=>"V","Г"=>"G",
	        "Д"=>"D","Е"=>"E","Ж"=>"J","З"=>"Z","И"=>"I",
	        "Й"=>"Y","К"=>"K","Л"=>"L","М"=>"M","Н"=>"N",
	        "О"=>"O","П"=>"P","Р"=>"R","С"=>"S","Т"=>"T",
	        "У"=>"U","Ф"=>"F","Х"=>"H","Ц"=>"TS","Ч"=>"CH",
	        "Ш"=>"SH","Щ"=>"SCH","Ъ"=>"","Ы"=>"YI","Ь"=>"",
	        "Э"=>"E","Ю"=>"YU","Я"=>"YA","а"=>"a","б"=>"b",
	        "в"=>"v","г"=>"g","д"=>"d","е"=>"e","ж"=>"j",
	        "з"=>"z","и"=>"i","й"=>"y","к"=>"k","л"=>"l",
	        "м"=>"m","н"=>"n","о"=>"o","п"=>"p","р"=>"r",
	        "с"=>"s","т"=>"t","у"=>"u","ф"=>"f","х"=>"h",
	        "ц"=>"ts","ч"=>"ch","ш"=>"sh","щ"=>"sch","ъ"=>"y",
	        "ы"=>"yi","ь"=>"","э"=>"e","ю"=>"yu","я"=>"ya"      
	    );
		// работают элементы массива
	    $str = strtr($str,$translit);		
		
		// в нижний регистр
	    $str = mb_strtolower($str);
	    // заменям все ненужное нам на "-"
	    $str = preg_replace('/[^A-Za-z0-9_]/', '_', $str);
	    // удаляем начальные и конечные '_'
	    $str = trim($str, "_");
	    return $str;
}

echo translit($str);

?>